Repository: 84000/data-translation-memory
Catalog: toh188-v3.tmx
Source language: bo
Languages: en

source: དེ་གཉིས་སྨོན་ལམ་བཏབ་ནས་ནི། །བྲམ་ཟེའི་ཁྱེ་འུས་ཨུད་པལ་བླངས། །དེ་དག་ཨུད་པལ་ཐོགས་ནས་ཀྱང་། །རྒྱལ་བའི་ཞབས་ལ་ཕྱག་འཚལ་ནས། །གལ་ཏེ་བདག་ལུས་སྐམས་གྱུར་ཅིང་། །
en: “The two of them made the aspiration, And the brahmin boy took the utpalas And, holding the utpala flowers, Bowed at the feet of the Victor: “ ‘Even if my body dries up And my bones turn white, Until I receive a prophecy of awakening I will not stand up today.

source: བདག་གི་རུས་པ་དཀར་གྱུར་ཀྱང་། །བྱང་ཆུབ་ལུང་མ་བསྟན་བར་དུ། །བདག་ནི་དེ་རིང་མི་ལྡང་ངོ་། །བདག་སྨོན་དེར་གྱུར་གཞན་དུ་མིན། །
en: My aspiration is that and nothing else.’

source: དེ་ནས་བུ་མོ་བཟང་ལེན་ལྡན་གྱིས་ཨུད་པལ་ལྔ་བླངས་ཏེ་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ལ་བྱིན་ནས་བྲམ་ཟེའི་ཁྱེའུ་ཨུད་པལ་འདི་དག་ལོང་ལ་རང་གི་མིང་གིས་སྐྲུན་ཅིག །
en: “The girl Receiver of Goodness then held up five utpala flowers and gave them to the brahmin boy Megha. ‘Young brahmin,’ she said, ‘take these utpalas and present them in your name.

source: བྲམ་ཟེའི་ཁྱེའུ་ཨུད་པལ་འདི་གཉིས་ཀྱང་ཁོ་མོའི་མིང་གིས་སྐྲུན་ཅིག །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ཨུད་པ་ལ་དེ་དག་ཁྱེར་ནས། གྲོང་ཁྱེར་གྱི་ཕྱི་རོལ་ཏུ་བྱུང་བ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་མཛེས་པ་དང་བར་བྱ་བ། དབང་པོ་དུལ་བ། ཐུགས་དུལ་བ། མཆོག་ཏུ་དུལ་བ། དང་ཞིང་ཞི་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ།
en: And, young brahmin, present these two utpala flowers in my name.’

source: དུལ་བ་དང་ཞི་བའི་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ། གླང་པོ་ཆེན་པོ་དབང་པོ་བསྲུང་ཞིང་ཐུལ་བ། མཚོ་ལྟར་དང་ཞིང་རྣམ་པར་དང་ལ་རྙོག་པ་མེད་པའི་གསེར་གྱི་མཆོད་སྡོང་ལྟར་མངོན་པར་འཕགས་པ། དཔལ་གྱིས་བརྗིད་པ། གཟི་བརྗིད་ཀྱིས་འབར་བ་མཐོང་ངོ་། །སེམས་ཅན་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། ཁྱེའུ་དང་། བུ་མོ་བརྒྱ་ཕྲག་དུ་མ་དང་། ལྷ་དང་། ལྷ་མ་ཡིན་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་མང་པོ་དང་། རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ཡང་བཙུན་མོའི་འཁོར་དང་ལྷན་ཅིག་ཏུ་མེ་ཏོག་དང་།
en: “The brahmin boy Megha, carrying those utpala flowers, went outside the city, where he saw the thus-gone, worthy, complete and perfect Buddha Dīpaṅkara, who was handsome and bright, with his faculties tamed and his mind tamed, supremely tamed, one who had attained the perfection of calm and peace, one who had attained the highest perfection of restraint and peace, a great elephant who guarded and controlled his senses, and like a clear and tranquil lake in which emerges an unsullied golden pillar, elevated, resplendent with glory, and blazing with splendor.

source: མེ་ཏོག་ཕྲེང་དང་། སྤོས་དང་བྱུག་པ་ཐོགས་ཏེ། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ཕྱིར་འོང་བ་ཡང་མཐོང་ནས། ཡང་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ནི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡིན་པར་བདག་གིས་ཐོས་ན།
en: “When he also saw the many trillions of beings, the many hundreds of boys and girls, the many gods, asuras, nāgas, yakṣas, gandharvas, garuḍas, kinnaras, and mahoragas, and King Ajātaśatru with his retinue of queens, all arriving together holding flowers, flower garlands, incense, and balms in order to make offerings to the Blessed One, he thought, ‘I have heard that the thus-gone, worthy, complete and perfect Buddha Dīpaṅkara is a thus-gone, worthy, complete and perfect buddha with the thirty-two marks of a great being, yet only thirty marks appear on this thus-gone one.

source: དེ་བཞིན་གཤེགས་པ་འདི་ལ་ནི་མཚན་སུམ་ཅུ་ཞིག་སྣང་སྟེ། མཚན་གཉིས་ནི་མི་སྣང་བས་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པ་མ་ཡིན་ནོ་སྙམ་མོ། །
en: Since two marks do not appear, he is not endowed with the thirty-two marks.’

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་གྱི་སེམས་ཀྱི་ཀུན་ཏུ་རྟོག་པ་ཐུགས་སུ་ཆུད་ནས། རྫུ་འཕྲུལ་ཇི་ལྟ་བུ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་པས་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་པོ་དེ་དག་སྣང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་དེ།
en: “The thus-gone, worthy, complete and perfect Buddha Dīpaṅkara, understanding the thoughts of the brahmin boy Megha, then manifested a display of miraculous power such that those thirty-two marks of a great being appeared—thus did he manifest a display of miraculous power.

source: བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་གྱིས་དེ་མཐོང་ནས་ཡང་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་དགའ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ། རབ་ཏུ་དགའ་བ་དང་།
en: On seeing this, the brahmin boy Megha was transported with satisfaction and delight.

source: ཡིད་བདེ་བ་སྐྱེས་ནས་པགས་པ་དེ་བཏིང་བ་དང་། དེ་ནས་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་གྱི་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་བའི་མི་དེ་དག་གིས་པགས་པ་དེ་བླངས་ནས། ཕན་ཚུན་དུ་བོར་ཏེ་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: With the rising of great joy and happiness, he spread out a skin, but the residents of the royal city Padmāvatī lifted up the skin, and together they tossed it away.

source: བྲམ་ཟེའི་ཁྱེའུ་མ་སྨྱོས་སམ།
en: They said to the brahmin boy Megha, ‘Brahmin child, are you crazy?

source: གང་དུ་རྒྱལ་པོའི་ན་བཟའ་གདིང་བ་དེར་ཁྱོད་ཀྱིས་པགས་པ་བཙོག་པ་འདི་གདིང་བར་བྱེད།
en: In the place where the king’s robes should be placed, you lay out this dirty skin!’

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་གྱིས་པགས་པ་བླངས་ནས། ལམ་ལས་བཟུར་ཏེ།
en: “The brahmin boy Megha picked up the skin and stepped aside from the road.

source: ལམ་གོལ་བར་འདུག་ནས་བདེན་པའི་ཚིག་འདི་བྱས་སོ། །བདེན་པ་དང་བདེན་ཚིག་གང་གིས་འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཁྱེན་པ་ཐམས་ཅད་གཟིགས་པ། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་ཡིན་ན། ཤུལ་ལས་བཟུར་ཏེ་བདག་གི་རལ་པ་ལ་ཞབས་འཇོག་པར་གྱུར་ཅིག །
en: Sitting down on a side path, he spoke these words of truth: ‘By the truth and these words of truth, if the Thus-Gone One, who is all-knowing and all-seeing, has compassion for the world, may he redirect his path and place his feet upon my matted hair.’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཞལ་ཕྱིར་གཟིགས་ནས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་གང་དུ་ངའི་ཞབས་གཉིས་འཇོག་པ་དེར་ཁྱོད་ཀྱིས་གཞག་པར་མི་བྱའོ། །
en: “The thus-gone, worthy, complete and perfect Buddha Dīpaṅkara looked behind him and said to the monks, ‘Monks, where I put my two feet, there you must not stand.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པའི་རལ་པ་ཡིན་པའི་ཕྱིར་རོ། །
en: If you ask why, it is because that is the matted hair of one who has honored many hundreds of sextillions of buddhas.’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཤུལ་ལས་བཟུར་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་གང་ན་བར་གཤེགས་ཏེ་བྱོན་པ་དང་།
en: “The thus-gone, worthy, complete and perfect Buddha Dīpaṅkara then stepped away from the road and went to where the brahmin boy Megha was.

source: ཞབས་གཉིས་རལ་པའི་སྟེང་དེར་བཞག་གོ། །
en: Arriving there, he placed his two feet on the matted hair.

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ཞིང་སའི་སྟེང་དེ་ནས་ལངས་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ལ་ཨུད་པ་ལ་དེ་དག་གཏོར་ཏོ། །
en: Then the brahmin boy Megha stood up from the ground and scattered the utpala flowers upon the thus-gone, worthy, complete and perfect Buddha Dīpaṅkara.

source: གཏོར་མ་ཐག་ཏུ་དེའི་ཚེ་དེ་བཞིན་གཤེགས་པའི་དབུའི་གཙུག་གི་སྟེང་གི་དྲང་ཐད་དུ་ཨུད་པ་ལའི་ཁང་པ་བརྩེགས་པ་གྲྭ་བཞིར་ཀ་བ་བཞི་ཟུག་པ། ཆ་མཉམ་པ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ། ཉམས་དགའ་བ། ཡིད་དུ་འོང་བ་ཞིག་གནས་པར་གྱུར་ཏེ།
en: The moment he scattered them, they came to rest directly above the crown of the Thus-Gone One as a pinnacled temple of utpala flowers built with four corners and four columns, equally proportioned and symmetrical, delightful and attractive.

source: ཁང་པ་བརྩེགས་པ་དེ་ན་ཡང་། །དེ་བཞིན་གཤེགས་པའི་སྐུ་སྣང་ངོ་། །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: In that pinnacled temple, moreover, appeared the body of the Thus-Gone One.

source: བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་དགེ་བའི་རྩ་བ་འདིས་མ་འོངས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ། རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: “Then the thus-gone, worthy, complete and perfect Buddha Dīpaṅkara said to the brahmin boy Megha, ‘Young brahmin, by these roots of virtue, in future times, after countless eons, you will become the thus-gone, worthy, complete and perfect buddha known as Śākyamuni, who will be endowed with knowledge and conduct, a well-gone one, a knower of the world, a charioteer who guides beings, an unsurpassed one, a teacher of gods and humans, a blessed buddha.’

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་འགྱུར་རོ། །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་བདག་ཉིད་ལུང་བསྟན་པ་ཐོས་ནས་དགའ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ། རབ་ཏུ་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས། དེའི་ཚེ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་བོ། །
en: “The brahmin boy Megha, having heard his own prophecy, was transported with satisfaction—with the rising of great joy and happiness, at that moment, he attained the acceptance of phenomena as unarisen.

source: དེ་བཟོད་པ་ཐོབ་ནས་སྟེང་གི་ནམ་མཁའ་བར་སྣང་ལ་ཏ་ལ་བདུན་སྲིད་དུ་འཕགས་ནས་ཏིང་ངེ་འཛིན་དྲུག་སྟོང་མངོན་དུ་གྱུར་ཅིང་། དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཀྱང་མངོན་དུ་གྱུར་ཏོ། །
en: Having attained that acceptance, he rose in the space of the sky above to the height of seven tala trees and manifested six thousand samādhis, and there appeared as many tathāgatas as there are grains of sand in the river Ganges.

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་བར་སྣང་ལས་བབས་ཏེ།
en: Then the brahmin boy Megha descended from the sky.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ནས། བཅོམ་ལྡན་འདས་ལས་རབ་ཏུ་བྱུང་བ་དང་དགེ་སློང་གི་དངོས་པོ་གསོལ་ཏོ། །
en: Offering prostrations at the feet of the Blessed One, he requested the Blessed One that he might go forth and become a monk.

source: ཀུན་དགའ་བོ་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སོམ་ཉིའམ། ཡིད་གཉིས་སམ། ཐེ་ཙོམ་ཟ་ན་ཀུན་དགའ་བོ་དེ་དེ་ལྟར་མི་བལྟའོ། །
en: “Ānanda, if you are doubtful, uncertain, or suspicious, thinking that the one who was, at that time, on that occasion, known as the brahmin boy Megha was someone else, Ānanda, you must not see it that way.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ཅེས་བྱ་བ་དེར་གྱུར་ཏོ། །
en: If you ask why, it was I myself who was, at that time, on that occasion, the one known as the brahmin boy Megha.

source: ཀུན་དགའ་བོ་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེའི་བུ་མོ་བཟང་ལེན་ལྡན་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སོམ་ཉིའམ། ཡིད་གཉིས་སམ། ཐེ་ཙོམ་ཟ་ན་ཀུན་དགའ་བོ་དེ་དེ་ལྟར་མི་བལྟའོ། །
en: “Ānanda, if you are doubtful, uncertain, or suspicious, thinking that the one who was, at that time, on that occasion, known as the brahmin girl Receiver of Goodness was someone else, Ānanda, you must not see it that way.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱཀྱའི་བུ་མོ་ས་འཚོ་མ་དེའི་ཚེ་དེའི་དུས་ན་བུ་མོ་བཟང་ལེན་ལྡན་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: If you ask why, it was the Śākya girl Gopā who was, at that time, on that occasion, the one known as the girl Receiver of Goodness.

source: ཀུན་དགའ་བོ་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་དུམ་བུ་བྱིན་ཞེས་བྱ་བར་གྱུར་པ་གང་རྒན་གྲལ་དུ་འདུག་སྟེ་སྦྱིན་སྲེག་བྱེད་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སོམ་ཉིའམ། ཡིད་གཉིས་སམ། ཐེ་ཙོམ་ཟ་ན་ཀུན་དགའ་བོ་དེ་དེ་ལྟར་མི་བལྟའོ། །
en: “Ānanda, if you are doubtful, uncertain, or suspicious, thinking that the one who was, at that time, on that occasion, known as the brahmin Giver of Pieces, who was sitting in the row of elders making burnt offerings, was someone else, Ānanda, you must not see it that way.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། མི་གཏི་མུག་ཅན་ལྷས་བྱིན་འདི་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་དུམ་བུ་བྱིན་དུ་གྱུར་ཏོ། །
en: If you ask why, it was the ignorant person Devadatta who was, at that time, on that occasion, the brahmin Giver of Pieces.

source: ཀུན་དགའ་བོ་དེ་ལྟ་བས་ན་དེའི་ཕྱིར་དགེ་བའི་རྩ་བས་ཆོག་ཤེས་པར་མི་བྱའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་།
en: “This, Ānanda, is why you must not be content with your roots of virtue.”

source: ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: When the Blessed One had spoken those words, the venerable Ānanda and the assembly consisting of the entire world with its gods, humans, asuras, and gandharvas rejoiced and praised the words of the Blessed One.

source: འཕགས་པ་མར་མེ་མཛད་ཀྱིས་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This completes the noble Mahāyāna sūtra “The Prophecy of Dīpaṅkara.”

source: རྒྱ་གར་གྱི་མཁན་པོ་བི་ཤུདྡྷ་སིང་ཧ་དང་། ལོཙྪ་བ་བན་དེ་དགེ་དཔལ་གྱིས་བསྒྱུར།
en: Translated by the Indian preceptor Viśuddhasiṃha and the translator Bandé Gepal.

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛྙཱ་ན་གརྦྷ་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དེ་ཀླུའི་རྒྱལ་མཚན་གྱིས་ཞུ་ཆེན་བགྱིས་ཏེ་གཏན་ལ་ཕབ་པ།། །།
en: The Indian preceptor Jñānagarbha and the great translator-editor Bandé Lui Gyaltsen edited and finalized it.
